wegam/STM32F1xWorkSpace/Driver/Components/SCR/R61509V - 20180510.c
	if(delta_x>0)
		incx=1; //设置单步方向 
	else if(delta_x==0)
		incx=0;//垂直线 
	else
		{
			incx=-1;
			delta_x=-delta_x;
		}
		
	if(delta_y>0)
		incy=1; 
	else if(delta_y==0)
		incy=0;//水平线 
	else
		{incy=-1;delta_y=-delta_y;} 
		
	if( delta_x>delta_y)
		distance=delta_x; 								//选取基本增量坐标轴 
	else
		distance=delta_y;
	
	for(t=0;t<distance+1;t++ )					//画线输出 
	{  
		R61509V_DrawDot(uRow,uCol,color);	//画点 
		xerr+=delta_x ; 
		yerr+=delta_y ; 
		if(xerr>distance) 
		{ 
			xerr-=distance; 
			uRow+=incx; 
		} 
		if(yerr>distance) 
		{ 
			yerr-=distance; 
			uCol+=incy; 
		} 
	}

//	u16	Num	=	0,i=0;
////	CoordinateTransform(&x1,&y1,&x2,&y2);
//	if(x1>x2)
//	{
//		Num	+=	x1-x2;
//	}
//	else
//	{
//		Num	+=	x2-x1;
//	}
//	if(y1>y2)
//	{
//		Num	+=	y1-y2;
//	}
//	else
//	{
//		Num	+=	y2-y1;
//	}
//	
//	R61509V_SetWindowAddress(x1,y1,x2,y2);//设置窗地址
//	for(i=0;i<Num;i++)
//	{
//		R61509V_WriteData16(color); 	//笔画颜色
//	}
}
/**************************************************************************************************
* [Function] LCD_DrawCircle:  函数功能、注意事项等的描述
* [param01]t_Point point: description
* [param02]u16 R: description
* [param03]uint8_t Filled: description
* [param04]u16 color: description
**************************************************************************************************/
void R61509V_DrawCircle(
												u16 x,u16 y,		//圆心坐标原点
												u16 r,					//半径
												u8 Filled,			//是否填充
												u16 color				//颜色
												)
{
	int a,b;
	int di;
	a=0;b=r;	  
	di=3-(r<<1);             //判断下个点位置的标志
	while(a<=b)
	{
		if(Filled)	//填充就画线
		{
			R61509V_DrawLine(x,y,x-b,y-a,color);             //3           
			R61509V_DrawLine(x,y,x+b,y-a,color);             //0           
			R61509V_DrawLine(x,y,x-a,y+b,color);             //1       
			R61509V_DrawLine(x,y,x-b,y-a,color);             //7           
			R61509V_DrawLine(x,y,x-a,y-b,color);             //2             
			R61509V_DrawLine(x,y,x+b,y+a,color);             //4               
			R61509V_DrawLine(x,y,x+a,y-b,color);             //5
			R61509V_DrawLine(x,y,x+a,y+b,color);             //6 
			R61509V_DrawLine(x,y,x-b,y+a,color);             
			a++;
			//使用Bresenham算法画圆     
			if(di<0)
				di +=4*a+6;	  
			else
			{
				di+=10+4*(a-b);   
				b--;
			}
			R61509V_DrawLine(x,y,x+a,y+b,color);				//AB 两个坐标画一条直线

		}
		else
		{
			R61509V_DrawDot(x-b,y-a,color);             //3           
			R61509V_DrawDot(x+b,y-a,color);             //0           
			R61509V_DrawDot(x-a,y+b,color);             //1       
			R61509V_DrawDot(x-b,y-a,color);             //7           
			R61509V_DrawDot(x-a,y-b,color);             //2             
			R61509V_DrawDot(x+b,y+a,color);             //4               
			R61509V_DrawDot(x+a,y-b,color);             //5
			R61509V_DrawDot(x+a,y+b,color);             //6 
			R61509V_DrawDot(x-b,y+a,color);             
			a++;
			//使用Bresenham算法画圆     
			if(di<0)
				di +=4*a+6;	  
			else
			{
				di+=10+4*(a-b);   
				b--;
			}
				R61509V_DrawDot(x+a,y+b,color);
		}
	}
}
/**************************************************************************************************
* [Function] LCD_DrawRectangle:  画一下矩形框
* [param01]t_Point top_p: 顶点坐标值
* [param02]t_Point botton_p : 地板坐标值
**************************************************************************************************/
void R61509V_DrawRectangle(u16 x1,u16 y1,u16 x2,u16 y2,u16 color)
{
	R61509V_DrawLine( x1, y1,	x1,	y2, color );
	R61509V_DrawLine( x1, y1,	x2,	y1, color );
	R61509V_DrawLine( x2, y1,	x2,	y2, color );
	R61509V_DrawLine( x1, y2,	x2,	y2, color );
}
/*******************************************************************************
* 函数名			:	function
* 功能描述		:	函数功能说明 
* 输入			: void
* 返回值			: void
* 修改时间		: 无
* 修改内容		: 无
* 其它			: wegam@sina.com
*******************************************************************************/
void WindowTest(void)
{
	u32 LCDTime=500;
	
	R61509V_Clean(R61509V_WHITE);		//清除屏幕函数--
	SysTick_DeleymS(LCDTime);				//SysTick延时nmS

//	R61509V_Clean(R61509V_BLACK);		//清除屏幕函数--
//	SysTick_DeleymS(LCDTime);				//SysTick延时nmS
//	
//	R61509V_Clean(R61509V_BLUE);		//清除屏幕函数--
//	SysTick_DeleymS(LCDTime);				//SysTick延时nmS
//	
//	R61509V_Clean(R61509V_BRED);			//清除屏幕函数--
//	SysTick_DeleymS(LCDTime);				//SysTick延时nmS
//	
//	R61509V_Clean(R61509V_GRED);			//清除屏幕函数--
//	SysTick_DeleymS(LCDTime);				//SysTick延时nmS
//	
//	R61509V_Clean(R61509V_GBLUE);			//清除屏幕函数--
//	SysTick_DeleymS(LCDTime);				//SysTick延时nmS
	
	R61509V_Clean(R61509V_RED);			//清除屏幕函数--
	SysTick_DeleymS(LCDTime);				//SysTick延时nmS
	
//	R61509V_Clean(R61509V_MAGENTA);			//清除屏幕函数--
//	SysTick_DeleymS(LCDTime);				//SysTick延时nmS
//	
//	R61509V_Clean(R61509V_GREEN);			//清除屏幕函数--
//	SysTick_DeleymS(LCDTime);				//SysTick延时nmS
//	
//	R61509V_Clean(R61509V_CYAN);			//清除屏幕函数--
//	SysTick_DeleymS(LCDTime);				//SysTick延时nmS
//	
//	R61509V_Clean(R61509V_YELLOW);			//清除屏幕函数--
//	SysTick_DeleymS(LCDTime);				//SysTick延时nmS
	
}









/**************************************************************************************************
* [Function] LCD_DrawPixelEx:  函数功能、注意事项等的描述
* [param01]u16 x: description
* [param02]u16 y: description
* [param03]u16 color: description
**************************************************************************************************/
void R61509V_DrawPixelEx( u16 x, u16 y, u16 color )
{
	R61509V_DrawDot(x,y,color);		//画点
}

















/**************************************************************************************************
* [Function] LCD_WriteCom:  函数功能、注意事项等的描述
* [param01]u16 Com: description
**************************************************************************************************/
void R61509V_Write_Bus( u16 Com )
{
	R61509V_CS_LOW;
	R61509V_RD_HIGH;
	R61509V_RS_LOW;
	R61509V_DATABUS_PORT->ODR = Com;
	R61509V_WR_LOW;
	R61509V_WR_HIGH;
	R61509V_CS_HIGH;
}

#if 1

/**************************************************************************************************
* [Function] LCD_WriteData:  函数功能、注意事项等的描述
* [param01]u16 Dat: description
**************************************************************************************************/
void R61509V_WriteData( u16 Dat )
{
	R61509V_CS_LOW;
	R61509V_RD_HIGH;
	R61509V_RS_HIGH;
	R61509V_DATABUS_PORT->ODR = Dat;
	R61509V_WR_LOW;
	R61509V_WR_HIGH;
	R61509V_CS_HIGH;
}
#endif
/**************************************************************************************************
* [Function] LCD_WriteCMD: 向lcd写入指令数据
* [param01]u16 addr: 指令
* [param02]u16 Data: 指令数据
**************************************************************************************************/
void R61509V_WriteCMD( u16 addr, u16 Data )
{
/*
 * LCD_WriteCom( addr );
 * LCD_WriteData( Data );
 */

