wegam/STM32F1xWorkSpace/Driver/Components/SCR/R61509V - 20180510.c
	R61509V_CS_LOW;
	R61509V_RD_HIGH;
	R61509V_RS_LOW;
	R61509V_DATABUS_PORT->ODR = addr;
	R61509V_WR_LOW;
	R61509V_WR_HIGH;
	R61509V_CS_HIGH;
	/*Delay_us( 200 ); */

	R61509V_CS_LOW;
	R61509V_RD_HIGH;
	R61509V_RS_HIGH;
	R61509V_DATABUS_PORT->ODR = Data;
	R61509V_WR_LOW;
	R61509V_WR_HIGH;
	R61509V_CS_HIGH;
}
/**************************************************************************************************
* [Function] LCD_GetCfg:  函数功能、注意事项等的描述
* [No param][return]*: description
**************************************************************************************************/
t_LcdCfg * LCD_GetCfg( void )
{
	return(&g_LcdCfg);
}
/**************************************************************************************************
* [Function] LCD_SetDrawWindow:  LCD 屏显示扫描方式
* [param01]t_Sreen_Rotate ScrnRotat: 相对于逐行从左到右 翻转角度值
* [param02]t_PixCfg PixCfg: 显示像素配置
* [param03]t_Point top_p: 顶点坐标
* [param04]u16 bottom_p: 底部坐标
**************************************************************************************************/
void R61509V_SetDrawWindow( t_Point top_p, t_Point bottom_p )
{
	u16 HSA, HEA, VSA, VEA;

	switch ( LCD_GetCfg()->ScrnRotat )
	{
	case SCREEN_ROTATE_0D:
	{
		HSA	= top_p.x;
		HEA	= bottom_p.x;
		VSA	= top_p.y;
		VEA	= bottom_p.y;
		break;
	}
	case SCREEN_ROTATE_90D:
	{
		HSA	= LCD_GetCfg()->PixCfg.YPixNum - bottom_p.y - 1;
		HEA	= LCD_GetCfg()->PixCfg.YPixNum - top_p.y - 1;
		VSA	= top_p.x;
		VEA	= bottom_p.x;
		break;
	}
	case SCREEN_ROTATE_180D:
	{
		HSA	= LCD_GetCfg()->PixCfg.XPixNum - bottom_p.x - 1;
		HEA	= LCD_GetCfg()->PixCfg.XPixNum - top_p.x - 1;
		VSA	= LCD_GetCfg()->PixCfg.YPixNum - bottom_p.y - 1;
		VEA	= LCD_GetCfg()->PixCfg.YPixNum - top_p.y - 1;
		break;
	}
	case SCREEN_ROTATE_270D:
	{
		HSA	= top_p.y;
		HEA	= bottom_p.y;
		VSA	= LCD_GetCfg()->PixCfg.XPixNum - bottom_p.x - 1;
		VEA	= LCD_GetCfg()->PixCfg.XPixNum - top_p.x - 1;
		break;
	}
	default: break;
	}
	R61509V_WriteCMD( R61509V_R210_HSA, HSA );
	R61509V_WriteCMD( R61509V_R211_HEA, HEA );
	R61509V_WriteCMD( R61509V_R212_VSA, VSA );
	R61509V_WriteCMD( R61509V_R213_VEA, VEA );
}


/**************************************************************************************************
* [Function] LCD_DrawDot:  画点
* [param01]t_Point StartPos: description
* [param02]u16 color: description
**************************************************************************************************/
void R61509V_DrawDotest(u16 x,u16 y, u16 color )
{
	/*
	 * t_Point endpos;
	 * u16 FWidth=1,FHeight=1;
	 * endpos.x	= StartPos.x + FWidth - 1;
	 * endpos.y	= StartPos.y + FHeight - 1;
	 */
//	if ( LCD_TRANSPARENT_COLOR != color )
//	{

		u16 HSA, HEA, VSA, VEA;
			HSA	= x;
			HEA	= x;
			VSA	= y;
			VEA	= y;
//#define Y_H	399     /*LCD_PHY_HEIGHT-1  CD_GetCfg()->PixCfg.YPixNum-1 */
//#define X_W	239     /*LCD_PHY_WIDTH-1  CD_GetCfg()->PixCfg.xPixNum-1 */

//		switch ( LCD_GetCfg()->ScrnRotat )
//		{
//		case SCREEN_ROTATE_0D:
//		{
//			HSA	= StartPos.x;
//			HEA	= StartPos.x;
//			VSA	= StartPos.y;
//			VEA	= StartPos.y;
//			break;
//		}
//		case SCREEN_ROTATE_90D:
//		{
//			HSA	= LCD_GetCfg()->PixCfg.YPixNum - StartPos.y-1;
//			HEA	= LCD_GetCfg()->PixCfg.YPixNum - StartPos.y-1;
//			VSA	= StartPos.x;
//			VEA	= StartPos.x;
//			break;
//		}
//		case SCREEN_ROTATE_180D:
//		{
//			HSA	= LCD_GetCfg()->PixCfg.YPixNum - StartPos.x-1;
//			HEA	= LCD_GetCfg()->PixCfg.YPixNum - StartPos.x-1;
//			VSA	= LCD_GetCfg()->PixCfg.YPixNum - StartPos.y-1;
//			VEA	= LCD_GetCfg()->PixCfg.YPixNum - StartPos.y-1;
//			break;
//		}
//		case SCREEN_ROTATE_270D:
//		{
//			HSA	= StartPos.y;
//			HEA	= StartPos.y;
//			VSA	= LCD_GetCfg()->PixCfg.XPixNum - StartPos.x-1;
//			VEA	= LCD_GetCfg()->PixCfg.XPixNum - StartPos.x-1;
//			break;
//		}
//		default: break;
//		}
		R61509V_WriteCMD( R61509V_R210_HSA, HSA );
		R61509V_WriteCMD( R61509V_R211_HEA, HEA );
		R61509V_WriteCMD( R61509V_R212_VSA, VSA );
		R61509V_WriteCMD( R61509V_R213_VEA, VEA );


		R61509V_WriteCMD( R61509V_R200_HA, HSA );
		R61509V_WriteCMD( R61509V_R201_VA, VSA );
		R61509V_Write_Bus( R61509V_R202_GDRW );


		R61509V_WriteData(color);

}
/**************************************************************************************************
* [Function] LCD_DrawDot:  画点
* [param01]t_Point StartPos: description
* [param02]u16 color: description
**************************************************************************************************/
void R61509V_DrawDotB( t_Point StartPos, u16 color )
{
	/*
	 * t_Point endpos;
	 * u16 FWidth=1,FHeight=1;
	 * endpos.x	= StartPos.x + FWidth - 1;
	 * endpos.y	= StartPos.y + FHeight - 1;
	 */
	if ( LCD_TRANSPARENT_COLOR != color )
	{
	#if 1
		u16 HSA, HEA, VSA, VEA;
#define Y_H	399     /*LCD_PHY_HEIGHT-1  CD_GetCfg()->PixCfg.YPixNum-1 */
#define X_W	239     /*LCD_PHY_WIDTH-1  CD_GetCfg()->PixCfg.xPixNum-1 */

		switch ( LCD_GetCfg()->ScrnRotat )
		{
		case SCREEN_ROTATE_0D:
		{
			HSA	= StartPos.x;
			HEA	= StartPos.x;
			VSA	= StartPos.y;
			VEA	= StartPos.y;
			break;
		}
		case SCREEN_ROTATE_90D:
		{
			HSA	= LCD_GetCfg()->PixCfg.YPixNum - StartPos.y-1;
			HEA	= LCD_GetCfg()->PixCfg.YPixNum - StartPos.y-1;
			VSA	= StartPos.x;
			VEA	= StartPos.x;
			break;
		}
		case SCREEN_ROTATE_180D:
		{
			HSA	= LCD_GetCfg()->PixCfg.YPixNum - StartPos.x-1;
			HEA	= LCD_GetCfg()->PixCfg.YPixNum - StartPos.x-1;
			VSA	= LCD_GetCfg()->PixCfg.YPixNum - StartPos.y-1;
			VEA	= LCD_GetCfg()->PixCfg.YPixNum - StartPos.y-1;
			break;
		}
		case SCREEN_ROTATE_270D:
		{
			HSA	= StartPos.y;
			HEA	= StartPos.y;
			VSA	= LCD_GetCfg()->PixCfg.XPixNum - StartPos.x-1;
			VEA	= LCD_GetCfg()->PixCfg.XPixNum - StartPos.x-1;
			break;
		}
		default: break;
		}
		R61509V_WriteCMD( R61509V_R210_HSA, HSA );			//Window Horizontal RAM Address Start (R210h),
		R61509V_WriteCMD( R61509V_R211_HEA, HEA );			//Window Horizontal RAM Address End (R211h)
		R61509V_WriteCMD( R61509V_R212_VSA, VSA );			//Window Vertical RAM Address Start (R212h),
		R61509V_WriteCMD( R61509V_R213_VEA, VEA );			//Window Vertical RAM Address End (R213h)


