wegam/STM32F1xWorkSpace/Driver/Components/SCR/R61509V - 20180510.c
		R61509V_WriteCMD( R61509V_R200_HA, HSA );			//RAM Address Set (Horizontal Address) (R200h)
		R61509V_WriteCMD( R61509V_R201_VA, VSA );			//RAM Address Set (Vertical Address) (R201h)
		R61509V_Write_Bus( R61509V_R202_GDRW );
#else
		/*
		 * LCD_SetDrawWindow( StartPos, StartPos);
		 * LCD_SetGramAddress( StartPos );
		 */
#endif
		R61509V_WriteData(color);
/*
		LCD_CS_LOW;
		LCD_RD_HIGH;
		LCD_RS_HIGH;

		LCD_DATA_PORT->ODR = color;
		LCD_WR_LOW;
		LCD_WR_HIGH;
		LCD_CS_HIGH;*/
	}
}

void R61509V_EndDrawDot(void)
{
	R61509V_CS_HIGH;

}
/**************************************************************************************************
* [Function] LCD_SetGramAddress:  设置当前操作坐标点
* [param01]t_Sreen_Rotate ScrnRotat: 相对于逐行从左到右 翻转角度值
* [param02]t_PixCfg PixCfg: 显示像素配置
* [param03]t_Point point: 坐标点值
**************************************************************************************************/
void R61509V_SetGramAddress( t_Point point )
{
	u16 HA0 = 0, VA0 = 0;


	switch ( LCD_GetCfg()->ScrnRotat )
	{
	case SCREEN_ROTATE_0D:
	{
		HA0	= point.x;
		VA0	= point.y;
		break;
	}
	case SCREEN_ROTATE_90D:
	{
		HA0	= LCD_GetCfg()->PixCfg.YPixNum - point.y - 1;
		VA0	= point.x;
		break;
	}
	case SCREEN_ROTATE_180D:
	{
		HA0	= LCD_GetCfg()->PixCfg.XPixNum - point.x - 1;
		VA0	= LCD_GetCfg()->PixCfg.YPixNum - point.y - 1;
		break;
	}
	case SCREEN_ROTATE_270D:
	{	

		HA0	= point.y;
		VA0	= LCD_GetCfg()->PixCfg.XPixNum - point.x - 1;
		break;
	}
	default: break;
	}

	R61509V_WriteCMD( R61509V_R200_HA, HA0 );
	R61509V_WriteCMD( R61509V_R201_VA, VA0 );
	R61509V_Write_Bus( R61509V_R202_GDRW );
}


/**************************************************************************************************
* [Function] LCD_Setbackground:  设置背景颜色
* [param01]u16 BackColor: 背景颜色值
**************************************************************************************************/
void R61509V_Setbackground( u32 TotalPix, u16 BackColor )
{
	u32 i;

	R61509V_CS_LOW;
	R61509V_RD_HIGH;
	R61509V_RS_HIGH;

	for ( i = 0; i < TotalPix; i++ )
	{
		R61509V_DATABUS_PORT->ODR = BackColor;
		R61509V_WR_LOW;
		R61509V_WR_HIGH;
	}
	R61509V_CS_HIGH;
}


/**************************************************************************************************
* [Function] LCD_SetDrawMode:  函数功能、注意事项等的描述
* [No param]
**************************************************************************************************/
void R61509V_SetDrawMode( void )
{
#define BGR	( (u16) 1 << 12)        /*RGB顺序 */
#define DFM	( (u16) 1 << 14)        /*16-bit颜色，只能使用16-bit/8-bit接口 */
#define TRI	( (u16) 0 << 15)        /*8-bit接口下两次传输，16-bit接口下一次传输 */

	u8 Dat, HR, VR, AM, ORG;

	const u8 VHM[4][4][2] = { 6, 4, 5, 7, 0, 2, 3, 1,
				  5, 1, 0, 4, 3, 7, 6, 2,
				  0, 2, 3, 1, 6, 4, 5, 7,
				  3, 7, 6, 2, 5, 1, 0, 4 };


	if ( LCD_GetCfg()->DrawMode.Mode == 0 )
	{
		ORG	= 0;
		VR	= 0;
		HR	= 0;
		AM	= 0;
	}else {
		ORG	= 0;
		Dat	= VHM[LCD_GetCfg()->ScrnRotat][LCD_GetCfg()->DrawMode.Rotat][LCD_GetCfg()->DrawMode.Mirror];
		if ( Dat & 0x04 )
			VR = 1;
		else
			VR = 0;
		if ( Dat & 0x02 )
			HR = 1;
		else
			HR = 0;
		if ( Dat & 0x01 )
			AM = 1;
		else
			AM = 0;
	}

	R61509V_WriteCMD( R61509V_R003_EM, TRI | DFM | BGR | (ORG << 7) | (VR << 5) | (HR << 4) | (AM << 3) );
}











/**************************************************************************************************
* [Function] LCD_GetPixel:  函数功能、注意事项等的描述
* [param01]u16 X0: description
* [param02]u16 Y0: description
* [return]u16: description
**************************************************************************************************/
u16 R61509V_GetPixel( t_Sreen_Rotate ScrnRotat, t_PixCfg PixCfg, t_Point p )
{
	u16 Dat = 0;
	R61509V_SetGramAddress( p );
	R61509V_ReadData();
	Dat = R61509V_ReadData();
	return(Dat);
}


/**************************************************************************************************
* [Function] LCD_DrawHLine:  函数功能、注意事项等的描述
* [param01]u16 x: description
* [param02]u16 y: description
* [param03]u16 Len: description
* [param04]u16 color: description
**************************************************************************************************/
void R61509V_DrawHLine( u16 x, u16 y, u16 Len, u16 color )
{
	u16 i;

	for ( i = 0; i < Len; i++ )
		R61509V_DrawPixelEx( i + x, y, color );
}


/**************************************************************************************************
* [Function] LCD_DrawVLine:  函数功能、注意事项等的描述
* [param01]u16 x: description
* [param02]u16 y: description
* [param03]u16 Len: description
* [param04]u16 color: description
**************************************************************************************************/
void R61509V_DrawVLine( u16 x, u16 y, u16 Len, u16 color )
{
	u16 i;
	for ( i = 0; i < Len; i++ )
		R61509V_DrawPixelEx( x, i + y, color );
}


/**************************************************************************************************
* [Function] LCD_SetDispalyRange:  函数功能、注意事项等的描述
* [param01]t_LcdCfg * pLcdCfg: description
* [param02]u16 StartLine: description
* [param03]u16 LineNum: description
**************************************************************************************************/
void R61509V_SetDispalyRange( u16 StartLine, u16 LineNum )
{
	u16	DC1 = 0;
	u16	Width, Height;

	if ( LineNum < LCD_PHY_HEIGHT )
	{
		DC1 = (u16) LCD_DC1_IMAGE_ENABLE_BIT;
		R61509V_WriteCMD( R61509V_R500_PTDP, StartLine );
		R61509V_WriteCMD( R61509V_R501_PTSA, 0 );
		R61509V_WriteCMD( R61509V_R502_PTEA, LineNum - 1 );
		Height	= LineNum;
		Width	= LCD_PHY_WIDTH;
	}else {
		DC1	= (u16) LCD_DC1_PARTIAL_ENABLE_BIT;
		Height	= LCD_PHY_HEIGHT;
		Width	= LCD_PHY_WIDTH;
	}

	if ( (LCD_GetCfg()->ScrnRotat == SCREEN_ROTATE_0D) || (LCD_GetCfg()->ScrnRotat == SCREEN_ROTATE_180D) )
	{
		LCD_GetCfg()->PixCfg.XPixNum	= Width;
		LCD_GetCfg()->PixCfg.YPixNum	= Height;
	}else {
		LCD_GetCfg()->PixCfg.XPixNum	= Height;
		LCD_GetCfg()->PixCfg.YPixNum	= Width;
	}

	R61509V_WriteCMD( R61509V_R007_DC1, DC1 );
}


/**************************************************************************************************
* [Function] LCD_DrawBox:  同过顶点和底部坐标画一个矩形
* [param01]t_WinCfg cfg: LCD 相关配置参数
* [param02]t_Point * pTop: description
* [param03]t_Point * pBottom: description
**************************************************************************************************/
void R61509V_DrawBox( t_Point Top, t_Point Bottom )
{
	u32 i, Cnt;

	Cnt = (Bottom.x - Top.x + 1) * (Bottom.y - Top.y + 1);

	R61509V_SetDrawWindow( Top, Bottom );
	R61509V_SetGramAddress( Top );

