wegam/STM32F1xWorkSpace/Driver/Components/SCR/R61509V - 20180510.c
	R61509V_CS_LOW;
	R61509V_RS_HIGH;
	R61509V_RD_HIGH;


	for ( i = 0; i < Cnt; i++ )
	{
	
		R61509V_DATABUS_PORT->ODR = LCD_GetCfg()->ForeColor;
		R61509V_WR_LOW;
		R61509V_WR_HIGH;
	}
	R61509V_CS_HIGH;
}


///**************************************************************************************************
//* [Function] LCD_DrawLine:  AB 两个坐标画一条直线
//* [param01]t_Point * pPointA: A点坐标
//* [param02]t_Point * pPointB: b点坐标
//* [param03]u16 color: 颜色
//**************************************************************************************************/
//void R61509V_DrawLine( t_Point *pPointA, t_Point *pPointB, u16 color )
//{
//	s16	x, y, dx, dy, s1, s2;
//	s16	i, p, temp, interchange;


//	x	= pPointA->x;
//	y	= pPointA->y;

//	dx = pPointB->x - pPointA->x;
//	if ( dx < 0 )
//		dx = -dx;
//	dy = pPointB->y - pPointA->y;
//	if ( dy < 0 )
//		dy = -dy;

//	if ( pPointB->x > pPointA->x )
//		s1 = 1;
//	else
//		s1 = -1;

//	if ( pPointB->y > pPointA->y )
//		s2 = 1;
//	else
//		s2 = -1;

//	if ( dy > dx )
//	{
//		temp		= dx;
//		dx		= dy;
//		dy		= temp;
//		interchange	= 1;
//	}else {
//		interchange = 0;
//	}

//	p = 2 * dy - dx;

//	for ( i = 1; i <= dx; i++ )
//	{
//		R61509V_DrawPixelEx( x, y, color );
//		if ( p >= 0 )
//		{
//			if ( interchange == 0 )
//				y += s2;
//			else
//				x += s1;
//			p -= 2 * dx;
//		}
//		if ( interchange == 0 )
//			x += s1;
//		else
//			y += s2;
//		p += 2 * dy;
//	}
//}


///**************************************************************************************************
//* [Function] LCD_DrawRectangle:  画一下矩形框
//* [param01]t_Point top_p: 顶点坐标值
//* [param02]t_Point botton_p : 地板坐标值
//**************************************************************************************************/
//void R61509V_DrawRectangle( t_Point *pTop_p, t_Point *pBotton_p, u16 color )
//{
//	R61509V_DrawHLine( pTop_p->x, pTop_p->y, pBotton_p->x - pTop_p->x + 1, color );
//	R61509V_DrawVLine( pTop_p->x, pTop_p->y, pBotton_p->y - pTop_p->y + 1, color );
//	R61509V_DrawHLine( pTop_p->x, pBotton_p->y, pBotton_p->x - pTop_p->x + 1, color );
//	R61509V_DrawVLine( pBotton_p->x, pTop_p->y, pBotton_p->y - pTop_p->y + 1, color );
//}


///**************************************************************************************************
//* [Function] LCD_DrawCircle:  函数功能、注意事项等的描述
//* [param01]t_Point point: description
//* [param02]u16 R: description
//* [param03]uint8_t Filled: description
//* [param04]u16 color: description
//**************************************************************************************************/
//void R61509V_DrawCircle( t_Point point, u16 R, u8 Filled, u16 color )
//{
//	s16 x, y, d;

//	x	= 0;
//	y	= R;
//	d	= 1 - R;

//	while ( x < y )
//	{
//		if ( Filled )
//		{
//			R61509V_DrawHLine( -y + point.x, x + point.y, 2 * y, color );
//			R61509V_DrawHLine( -x + point.x, y + point.y, 2 * x, color );
//			R61509V_DrawHLine( -x + point.x, -y + point.y, 2 * x, color );
//			R61509V_DrawHLine( -y + point.x, -x + point.y, 2 * y, color );
//		}
//		else
//		{
//			R61509V_DrawPixelEx( y + point.x, x + point.y, color );
//			R61509V_DrawPixelEx( x + point.x, y + point.y, color );
//			R61509V_DrawPixelEx( x + point.x, -y + point.y, color );
//			R61509V_DrawPixelEx( y + point.x, -x + point.y, color );
//			R61509V_DrawPixelEx( -y + point.x, x + point.y, color );
//			R61509V_DrawPixelEx( -x + point.x, y + point.y, color );
//			R61509V_DrawPixelEx( -x + point.x, -y + point.y, color );
//			R61509V_DrawPixelEx( -y + point.x, -x + point.y, color );
//		}

//		if ( d < 0 )
//			d += 2 * x + 3;
//		else{
//			d += 2 * (x - y) + 5;
//			y--;
//		}
//		x++;
//	}
//}


/**************************************************************************************************
* [Function] LCD_DrawFullFillBuf:  全屏像素点单色填充显示
* [param01]u8 * pdata: 填充内存数据 每位 为 0 不显示 为1显示填充颜色 注意填充数据按行需求字节数对齐
* [param02]u16 color: 填充颜色值
**************************************************************************************************/
void R61509V_DrawFullFillBuf( u8 *pdata, u16 color )
{
	u16	i, j;
	u8	*pBuf		= pdata;
	u8	rowcount	= (LCD_PHY_WIDTH + 7) / 8;/*每行字节数 */
	t_Point p;
	p.x	= 0;
	p.y	= 0;
	R61509V_SetGramAddress( p );

	R61509V_CS_LOW;
	R61509V_RS_HIGH;
	R61509V_RD_HIGH;

	for ( j = 0; j < LCD_PHY_HEIGHT; j++ )
	{
		for ( i = 0; i < LCD_PHY_WIDTH; i++ )
		{
			if ( pBuf[i / 8] & (0x80 >> (i % 8) ) )
			{
				R61509V_DATABUS_PORT->ODR = color;
				R61509V_WR_LOW;
				R61509V_WR_HIGH;
			}
		}
		pBuf += rowcount;
	}


	R61509V_CS_HIGH;
}


/**************************************************************************************************
* [Function] LCD_DrawFullFillColorBuf:  函数功能、注意事项等的描述
* [param01]u8 * pdata: description
**************************************************************************************************/
void R61509V_DrawFullFillColorBuf( u8 *pdata )
{
	u16	i, j;
	u8	*pBuf = pdata;
	t_Point pos;
	pos.x	= 0;
	pos.y	= 0;
	R61509V_SetGramAddress( pos );

	R61509V_CS_LOW;
	R61509V_RS_HIGH;
	R61509V_RD_HIGH;

	for ( j = 0; j < LCD_PHY_HEIGHT; j++ )
	{
		for ( i = 0; i < LCD_PHY_WIDTH; i++ )
		{
			u16 color = pBuf[j * LCD_PHY_WIDTH + 2 * i] | pBuf[j * LCD_PHY_WIDTH + 2 * i + 1];


			R61509V_DATABUS_PORT->ODR = color;

			R61509V_WR_LOW;
			R61509V_WR_HIGH;
			/*  pBuf += 2; */
		}
	}

	R61509V_CS_HIGH;
}


/**************************************************************************************************
* [Function] LCD_DrawRectangleFillBuf:   矩形像素点单色填充显示
* [param01]t_Point top: 填充矩形开始坐标
* [param02]t_Point bottom: 填充矩形结束坐标
* [param03]u8 * pdata: 填充内存数据 每位 为 0 不显示 为1显示填充颜色 注意填充数据按行需求字节数对齐
* [param04]u16 color: 填充颜色值
**************************************************************************************************/
void R61509V_DrawRectangleFillBuf( t_LcdCfg *pcfg, t_Rect *pRect, u8 *pdata, u16 color )
{
	u16	i, j;
	u8	*pBuf		= pdata;
	u8	rowcount	= (pRect->bottom.x - pRect->top.x + 7) / 8;/*每行字节数 */

	t_Point pos;
	pos.x	= 0;
	pos.y	= 0;
	R61509V_SetGramAddress( pos );


	R61509V_CS_LOW;
	R61509V_RS_HIGH;
	R61509V_RD_HIGH;

	for ( j = 0; j < LCD_PHY_HEIGHT; j++ )
	{
		for ( i = 0; i < LCD_PHY_WIDTH; i++ )
		{
			if ( pBuf[i / 8] & (0x80 >> (i % 8) ) )
			{
				R61509V_DATABUS_PORT->ODR = color;
				R61509V_WR_LOW;
				R61509V_WR_HIGH;
			}/*else {
			  * LCD_DATA_PORT->ODR = color;
			  * LCD_WR_LOW;
			  * LCD_WR_HIGH;
			  * }*/
		}
		pBuf += rowcount;
	}

	R61509V_CS_HIGH;
}


